app/Controllers/Appointments.php

SELECT *
FROM `appointments`
---
    public function viewSchedules()
    {
        // Fetch all appointments from the database
        $appointmentModel = new AppointmentModel();
        $appointments = $appointmentModel->findAll(); // Fetch all appointments