app/Controllers/AppointmentController.php

INSERT INTO `appointments` (`appointment_date`, `appointment_time`, `appointment_day`) VALUES ('2025-04-28', '09:00', 'monday')
---
    public function book()
    {

        $date = $this->request->getPost('date');
        $time = $this->request->getPost('time');
        // $day = $this->request->getPost('day');

        $appointmentModel = new AppointmentModel();
        $appointmentModel->save([
            'appointment_date' => $date,
            'appointment_time' => $time,
            // 'appointment_day' => $day,
        ]);